import pandas as pd

df = pd.read_excel("new_dataset.xlsx")

first_index = ["За послеaдние 3 года фирма осуществляла выбросы CO2 (углекислого газа)?",
"Последние 3 года фирма имела целевые уровни по потреблению энергии?",
"Последние 3 года фирма принимала меры для повышения энергоэффективности?",
"Улучшение систем подогрева и охлаждения",
"Применение более благоприятных для климата источников энергии",
"Модернизация оборудования",
"Управление энергопотреблением",
"Минимизация отходов, переработка",
"Меры по ограничению загрязнения воздуха",
"Управление потреблением воды",
"Модернизация транспортных средств, судов, самолетов",
"Усовершенствование системы освещения",
"Меры по ограничению загрязнения окружающей среды"]


sum_values = 0
count = 0

for column in first_index:
    sum_values += df[column].apply(lambda x: x if x in [0, 1] else 0).sum()
    count += df[column].apply(lambda x: 1 if x in [0, 1] else 0).sum()

df['ecology_index'] = sum_values / count

print(df)
    